nxp-mcuxpresso/mcux-sdk/devices/MCXC041/MCXC041.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#define I2C_S1_REG(base)                  I2C_S_REG(base)
#define I2C_S1_RXAK_MASK                  I2C_S_RXAK_MASK
#define I2C_S1_RXAK_SHIFT                 I2C_S_RXAK_SHIFT
#define I2C_S1_IICIF_MASK                 I2C_S_IICIF_MASK
#define I2C_S1_IICIF_SHIFT                I2C_S_IICIF_SHIFT
#define I2C_S1_SRW_MASK                   I2C_S_SRW_MASK
#define I2C_S1_SRW_SHIFT                  I2C_S_SRW_SHIFT
#define I2C_S1_RAM_MASK                   I2C_S_RAM_MASK
#define I2C_S1_RAM_SHIFT                  I2C_S_RAM_SHIFT
#define I2C_S1_ARBL_MASK                  I2C_S_ARBL_MASK
#define I2C_S1_ARBL_SHIFT                 I2C_S_ARBL_SHIFT
#define I2C_S1_BUSY_MASK                  I2C_S_BUSY_MASK
#define I2C_S1_BUSY_SHIFT                 I2C_S_BUSY_SHIFT
#define I2C_S1_IAAS_MASK                  I2C_S_IAAS_MASK
#define I2C_S1_IAAS_SHIFT                 I2C_S_IAAS_SHIFT
#define I2C_S1_TCF_MASK                   I2C_S_TCF_MASK
#define I2C_S1_TCF_SHIFT                  I2C_S_TCF_SHIFT
#define I2C0_S1                           I2C0_S
#define I2C_FLT_STOPIE_MASK               This_symbol_has_been_deprecated
#define I2C_FLT_STOPIE_SHIFT              This_symbol_has_been_deprecated
#define MCG_HCTRIM_COARSE_TRIM_MASK       This_symbol_has_been_deprecated
#define MCG_HCTRIM_COARSE_TRIM_SHIFT      This_symbol_has_been_deprecated
#define MCG_HCTRIM_COARSE_TRIM(x)         This_symbol_has_been_deprecated
#define MCG_HTTRIM_TEMPCO_TRIM_MASK       This_symbol_has_been_deprecated
#define MCG_HTTRIM_TEMPCO_TRIM_SHIFT      This_symbol_has_been_deprecated
#define MCG_HTTRIM_TEMPCO_TRIM(x)         This_symbol_has_been_deprecated
#define MCG_HFTRIM_FINE_TRIM_MASK         This_symbol_has_been_deprecated
#define MCG_HFTRIM_FINE_TRIM_SHIFT        This_symbol_has_been_deprecated
#define MCG_HFTRIM_FINE_TRIM(x)           This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_STRIMRNG_MASK        This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_STRIMRNG_SHIFT       This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_STRIMRNG(x)          This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_FTRIMRNG_MASK        This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_FTRIMRNG_SHIFT       This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_FTRIMRNG(x)          This_symbol_has_been_deprecated
#define MCG_LFTRIM_LIRC_FTRIM_MASK        This_symbol_has_been_deprecated
#define MCG_LFTRIM_LIRC_FTRIM_SHIFT       This_symbol_has_been_deprecated
#define MCG_LFTRIM_LIRC_FTRIM(x)          This_symbol_has_been_deprecated
#define MCG_LSTRIM_LIRC_STRIM_MASK        This_symbol_has_been_deprecated
#define MCG_LSTRIM_LIRC_STRIM_SHIFT       This_symbol_has_been_deprecated
#define MCG_LSTRIM_LIRC_STRIM(x)          This_symbol_has_been_deprecated
#define PTA_BASE                          GPIOA_BASE
#define PTB_BASE                          GPIOB_BASE
#define PTA                               GPIOA
#define PTB                               GPIOB
#define FPTA_BASE                         FGPIOA_BASE
#define FPTB_BASE                         FGPIOB_BASE
#define FPTA                              FGPIOA
#define FPTB                              FGPIOB

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MCXC041_H_ */

